import {Mock} from '../types/types'

export const mock: Mock = {
    test: [
        {
            id: 0,
            name: 'Тест на время',
            timer: 1,
            questions: [
                {
                    type: 'multipleChoice',
                    number: 1,
                    text: 'Какие из городов расподложены в Европе?',
                    options: ['Париж', 'Шанхай', 'Нью-Йорк', 'Мадрид'],
                    answer: ['Париж', 'Мадрид'],
                },
                {
                    type: 'singleChoice',
                    number: 2,
                    text: 'Назовите сталицу Франции?',
                    options: ['Париж', 'Шанхай', 'Нью-Йорк', 'Мадрид'],
                    answer: 'Париж',
                },
                {
                    type: 'shortAnswer',
                    number: 3,
                    text: 'Чему равен положительный корень из 81',
                    answer: '9',
                },
                {
                    type: 'longAnswer',
                    number: 4,
                    text: 'Как сформулирован третий закон Ньютона?',
                    answer: 'Действию всегда есть равное и противоположное противодействие, иначе, взаимодействия двух тел друг на друга между собою равны и направлены в противоположные стороны',
                },
            ],
        },
        {
            id: 1,
            name: 'Тест без времени',
            questions: [
                {
                    type: 'multipleChoice',
                    number: 1,
                    text: 'Какие из городов расподложены в Европе?',
                    options: ['Париж', 'Шанхай', 'Нью-Йорк', 'Мадрид'],
                    answer: ['Париж', 'Мадрид'],
                },
                {
                    type: 'singleChoice',
                    number: 2,
                    text: 'Назовите сталицу Франции?',
                    options: ['Париж', 'Шанхай', 'Нью-Йорк', 'Мадрид'],
                    answer: 'Париж',
                },
                {
                    type: 'shortAnswer',
                    number: 3,
                    text: 'Чему равен положительный корень из 81',
                    answer: '9',
                },
                {
                    type: 'longAnswer',
                    number: 4,
                    text: 'Как сформулирован третий закон Ньютона?',
                    answer: 'Действию всегда есть равное и противоположное противодействие, иначе, взаимодействия двух тел друг на друга между собою равны и направлены в противоположные стороны',
                },
            ],
        },
    ],
};